/*
＜画像ファイルの種類＞

〇JPEG
圧縮率を指定できるやつ（高いと汚い）
透明、半透明むり
写真向き
イラスト（べた塗）苦手

おっきいやつ〇
キャラ絵、エフェクト×

〇PNG
きれい
透明、半透明できる
容量でかい


〇BMP
Windows標準
無圧縮→きれい
容量でかいだいぶ
ほぼ使わない
画像を当たり判定として使う

〇GIF
256色しか使えない
透明色あり、半透明なし
アニメーションできる
ゲームでは使えない

〇PSD
フォトショップのやつ




 //移動
    //xは＋でみぎにいく。yは＋で上に行く。
    //zは＋で奥に行く。（カメラの位置による）
    //transform_.position_.x += 0.1;

    //transform_.position_.x -= 0.1;

    //拡大
    //transform_.scale_.x += 1.01;
    //transform_.scale_.y += 1.01;
    //transform_.scale_.z += 1.01;

    //回転
    //x軸で５度回転
    //transform_.rotate_.y += 5;
    //transform_.rotate_.z += 5;

    //スペースキーが押されていたら(押されている間)→Input::IsKey
    //キーを押した回数→Input::IsKeyDown
    //キーを離した回数→Input::IsKeyUp





やるやつ
〇タイトル
〇敵動かす
自分のHP表示|M
なぎの体力（ラブ）|M?
〇なぎの体分裂|M
なぎに服を着せる|M.P
さなの顔|M
プレイシーンの背景（ハ－トとらぶメーターの枠のやつ付け足し）|P
選択|?V.P
〇怒りを動かしてみる
〇たまの打つスピード
〇なぎ上から登場|V
当たり判定なぎの手足にも|V
なぎの手足を飛ばす|V
色の上下

なぎの左右


自分がやったこと
箇条書き
操作方法
がんばったとこ
録画

*/